Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་དུ་ལྷག་པའི་བསམ་པས་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཆ་གཅིག་ཟོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་འཁོར་བའི་ལས་དང་ཉོན་མོངས་པའི་འཇིགས་པ་དང་བྲལ་བ་ཡིན་ཏེ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མངོན་པར་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ནང་ན་འདུག་ཀྱང་ཡང་དག་པའི་མཐའ་མངོན་དུ་བྱ་བའི་ལམ་གོལ་བར་ལྟུང་བས་གནོད་པར་མི་འགྱུར་རོ། །
en: In the same way, bodhisattvas who with a higher motivation eat only a part of the aspiration to enlightenment will become free from fear of the kleśas, and even though they come into the presence of all śrāvakas and pratyeka­buddhas and remain there, they will not be harmed by falling into the wrong path for manifesting the final conclusion.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། བདུད་རྩིའི་ཆུ་འཐུངས་པའི་སྐྱེས་བུ་ནི་གཞན་གྱི་གནོད་པར་བྱ་བ་ཐམས་ཅད་ཀྱིས་མི་འཆིའོ། །
en: “Noble one, a person who drinks amrita will not die as the result of any harm from others.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་བདུད་རྩིའི་ཆུ་འཐུངས་པ་ཡང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སར་མི་འཆིའོ། །བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོའི་སྨོན་ལམ་ལས་ཀྱང་རྒྱུན་འཆད་པར་མི་འགྱུར་རོ། །
en: In the same way, the bodhisattva who drinks the amrita of the development of the aspiration to omniscience will not die on the level of any śrāvaka or pratyeka­buddha and will not cease the continuous bodhisattva prayers of great compassion.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། བསྐུ་བ་གྲུབ་པའི་སྐྱེས་བུ་ནི་མིའི་གནས་ཐམས་ཅད་ན་རྣམ་པར་སྤྱོད་ཀྱང་མྱི་ཀུན་གྱིས་མི་མཐོང་ངོ་། །
en: “Noble one, a person who has the magical accomplishment of collyrium can be active within all human habitations but will be seen by no one.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་ཤེས་རབ་དང་སྨོན་ལམ་གྱིས་ཉེ་བར་བསྟན་པ་བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་རྣམ་པར་སྤྱོད་ཀྱང་བདུད་ཐམས་ཅད་ཀྱིས་མི་མཐོང་ངོ་། །
en: In the same way, the bodhisattva who relies on the wisdom and prayer of the development of the aspiration to enlightenment, although active in all the realms of the māras, will not be seen by any māra.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱལ་པོ་ཆེན་པོ་ལ་རྟེན་པའི་སྐྱེས་བ་ནི་སྐྱེ་བོ་མ་རབས་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་སོ། །
en: “Noble one, a person who is supported by a great king has no fear of ordinary people.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆེན་པོ་ལ་རྟེན་པ་ཡང་སྒྲིབ་པ་དང་བར་ཆད་དང་ངན་སོང་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་སོ། །
en: In the same way, the bodhisattva who is supported by the great king of the Dharma, which is the development of the aspiration to enlightenment, has no fear of all obscurations, obstacles, and lower realms.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ས་ཕུག་གི་ཁྱིམ་ན་གནས་ན་སའི་གསེ་བ་ཐམས་ཅད་རླན་གྱིས་ཡོངས་སུ་གང་བས་མེའི་འཇིགས་པ་མེད་དོ། །
en: “Noble one, if something lives in a hole in the ground and that gap in the earth is saturated with water, it has no fear of fire.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཀྱི་རྒྱུད་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་དགེ་བའི་རྩ་བས་མངོན་པར་བརླན་པ་ལའང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་ཀྱི་མྱེས་འཇིགས་པ་མེད་དོ། །
en: In the same way, the bodhisattva whose mind is saturated by the roots of merit of the aspiration to enlightenment has no fear of the fire of the wisdom of liberation of the śrāvakas and pratyeka­buddhas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། དཔའ་བོ་ལ་རྟེན་པའི་མྱི་ནི་དགྲ་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་སོ། །
en: “Noble one, a person who is supported by a hero has no fear of any enemy.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་དཔའ་བོ་ལ་རྟེན་པ་ཡང་སྤྱོད་པ་ངན་པའི་དགྲ་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་སོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, the bodhisattva who is supported by the hero that is the development of the aspiration to omniscience has no fear of the enemy that is bad conduct.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་རྡོ་རྗེའི་ལག་ཅ་ཐོགས་པ་ནི་ལྷ་མ་ཡིན་གྱི་ཚོགས་ཐམས་ཅད་རབ་ཏུ་འཇོམ་མོ། །
en: “Noble one, Śakra, the lord of the devas, wielding the weapon of the vajra, defeats the entire host of asuras.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་བརྟན་པའི་ལྷག་པའི་བསམ་པ་རྡོ་རྗེའི་ལག་ཅ་ཐོགས་པ་ཡང་བདུད་དང་ཕས་ཀྱི་རྒོལ་བའི་ལྷ་མ་ཡིན་གྱི་ཚོགས་ཐམས་ཅད་རབ་ཏུ་འཇོམ་མོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, the bodhisattva who wields the vajra weapon of the higher motivation that is dependent on the development of the aspiration to omniscience defeats the entire host of the asuras who are māras and adversaries.

source: རྩི་རོའི་བཅུད་འཐུངས་པའི་སྐྱེས་བུ་ནི་ཚེ་ཤིན་ཏུ་རིང་བར་གནས་སོ། །ཉམ་ཆུང་བར་མི་འགྱུར་རོ། །རྒ་བར་མི་འགྱུར་རོ། །
en: “Noble one, a person who drinks the elixir of life will have a very long life, will not become weak, and will not grow old.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་རོའི་བཅུད་ཀྱི་ཚོགས་འཐུངས་པ་ཡང་བསྐལ་པ་གྲངས་མེད་པར་འཁོར་བ་ན་འཁོར་ཡང་ཡོངས་སུ་སྐྱོ་བ་མེད་ལ་འཁོར་བའི་སྐྱོན་གྱིས་མི་གོས་སོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, the bodhisattva who drinks the accumulated life-elixir of the development of the aspiration to omniscience will continue in saṃsāra for countless kalpas without ever wearying or becoming stained by the defects of saṃsāra.

source: སྨན་གྱི་རོ་སྦྱར་རོ་ཅོག་ཐམས་ཅད་དུ་ཆུ་ནི་སྔོན་དུ་འགྲོ་བ་སྟེ། གང་ལའང་སྐྱོན་དུ་མི་འགྱུར་རོ། །
en: “Noble one, in all preparations of herbal medicines, one first needs water, and then they will not turn bad.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱི་ཚོགས་སྦྱར་བ་ཐམས་ཅད་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་ནི་སྔོན་དུ་འགྲོ་བ་སྟེ། གང་ལ་ཡང་སྐྱོན་དུ་མི་འགྱུར་རོ། །
en: In the same way, in practicing an accumulation of all bodhisattva conduct and prayer, one first needs to have the development of the aspiration to omniscience, and then they will not turn bad.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། མིའི་དོན་དུ་བྱ་བ་ཐམས་ཅད་ལ་ནི་སྲོག་གི་དབང་པོ་སྔོན་དུ་འགྲོའོ། །
en: “Noble one, in all accomplishment of human goals, there must first be the faculty of life.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་བླང་བ་ལའང་བྱང་ཆུབ་ཀྱི་སེམས་སྔོན་དུ་འགྲོའོ། །
en: In the same way, the bodhisattva must first have the aspiration to enlightenment in order to acquire all the Dharmas of the buddhas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་སྲོག་གི་དབང་པོ་དང་བྲལ་བ་ནི་ལས་ཐམས་ཅད་ལ་མཐུ་མེད་པས་ཕ་མ་དང་གཉེན་བཤེས་ཀྱི་ཚོགས་ཀྱིས་ཀྱང་ཉེ་བར་འཚོ་བར་བྱར་མེད་དོ། །
en: “Noble one, a person who is deprived of the faculty of life has no power to perform any action and cannot be brought to life even by parents and a host of relatives.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་དང་བྲལ་བ་ཡང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཐོབ་པར་བྱ་བ་ལ་མཐུ་མེད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡོན་ཏན་གྱིས་ཉེ་བར་འཚོ་བར་བྱར་མྱེད་དོ། །
en: In the same way, bodhisattvas who are separate from the development of the aspiration to omniscience will have no power to attain the wisdom of the buddhas, and all beings cannot bring them to life with the qualities of omniscience.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱ་མཚོ་ཆེན་པོ་ནི་དུག་ཐམས་ཅད་ཀྱིས་གདུག་པར་མི་ནུས་སོ། །
en: “Noble one, the great ocean cannot be poisoned by any poisons.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་རྒྱ་མཚོ་ཆེན་པོ་ཡང་ལས་དང་ཉོན་མོངས་པ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་སུ་སེམས་བསྐྱེད་པའི་དུག་ཐམས་ཅད་ཀྱིས་གདུག་པར་མི་ནུས་སོ། །
en: In the same way, the great ocean of the development of the aspiration to omniscience cannot be poisoned by any of the poisons of karma, kleśas, or the aspirations to enlightenment of the śrāvakas and pratyeka­buddhas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ཉི་མའི་དཀྱིལ་འཁོར་ནི་སྐར་མ་ཐམས་ཅད་ཀྱི་འོད་ཀྱིས་ཐུབ་པར་མི་ནུས་སོ། །
en: “Noble one, the light of all the stars cannot overwhelm the disk of the sun.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་ཉི་མའི་དཀྱིལ་འཁོར་ཡང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སྐར་མ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་ཟག་པ་མེད་པའི་འོད་ཀྱིས་མི་ཐུབ་བོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, the sun disk of the development of aspiration to omniscience cannot be overwhelmed by the immaculate qualities of all śrāvaka and pratyeka­buddha stars.

source: རྒྱལ་པོའི་བུ་སྐྱེས་ནས་ཡུན་རིང་དུ་མ་ལོན་པ་ཡང་བློའི་མཆོག་ཏུ་བྱ་བ་ནས་རྒན་པ་ཐམས་ཅད་རིགས་སུ་རིགས་དང་ལྡན་པར་སྐྱེས་པ་དང་། དབང་གིས་ཟིལ་གྱིས་གནོན་ཏོ། །
en: “Noble one, not long after a prince has been born, he outshines the highest ministers who are his seniors through being of noble birth and sovereignty.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་རིང་པོ་མ་ལོན་པ་ཆོས་ཀྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་སྐྱེས་པ་ལས་དང་པོ་བ་ཡང་ཡུན་རིང་པོ་ནས་ཚངས་པར་སྤྱོད་སྤྱོད་པའི་ཉན་ཐོས་ནས་རྒན་པ་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོའི་དབང་གི་ཟིལ་གྱིས་གནོན་ཏོ། །
en: In the same way, not long after bodhisattvas have developed the aspiration for enlightenment, through being born in the family of the Dharma kings, the tathāgatas, even though they are beginners, through the sovereignty of the great compassion of the aspiration to enlightenment, they outshine all the śrāvakas who are their seniors in having practiced celibacy for a long time.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། བློན་པོ་ཇི་ཙམ་དུ་ནས་རྒན་པས་ཀྱང་རྒྱལ་བུ་གཞོན་ནུ་ཇི་ཙམ་དུ་ཆུང་བ་ལ་ཡང་ཕྱག་བྱ་དགོས་སོ། །རྒྱལ་པོའི་བུས་ཀྱང་བློན་པོ་རྒན་པོ་ལ་རིམ་གྲོར་མི་བྱ་བ་མ་ཡིན་ནོ། །
en: “Noble one, all ministers have to pay homage to a prince, however young he is and however senior to him they are, and yet the prince does not disrespect the senior ministers.

source: དེ་བཞིན་དུ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཇི་ཙམ་དུ་རྒན་ལ་ཇི་ཙམ་དུ་ཚངས་པའི་སྤྱོད་པ་རིང་དུ་སྤྱོད་སྤྱོད་པ་རྣམས་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ལས་དང་པོ་བ་ལ་གདུད་པར་བྱའོ། །
en: In the same way, however senior the śrāvakas and pratyeka­buddhas may be, however long they have been practicing celibacy, they should bow down to a beginner bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔས་ཀྱང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ལ་རིམ་གྲོ་མེད་པར་བྱ་བ་མ་ཡིན་ནོ། །
en: Also, the bodhisattvas should not disrespect the śrāvakas and pratyeka­buddhas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱལ་པོའི་བུ་ཐམས་ཅད་ཀྱིས་མི་དགོས་པར་བྱ་བ་ཞིག་ནའང་རྒྱལ་པོའི་མཚན་དང་ལྡན་ན་རིགས་ཀྱི་བཙུན་པས་རྒྱལ་པོའི་བློན་པོ་དམ་པར་བྱ་བ་ཐམས་ཅད་དང་ཡང་མི་མཉམ་མོ། །
en: “Noble one, even though a prince is not needed by anyone, because he has the royal title and because of the nobility of his family, none of the king’s ministers is his equal.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ལས་དང་པོ་བ་ལས་དང་ཉོན་མོངས་པའི་ཉེ་བར་ལེན་པ་ཐམས་ཅད་ཀྱིས་ནོན་པ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་མཚན་དང་ལྡན་ན། སངས་རྒྱས་ཀྱི་རིགས་ཀྱིས་བཙུན་ཞིང་ཆེ་བས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་མཆོག་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་ཡང་མི་མཉམ་མོ། །
en: In the same way, even though beginner bodhisattvas are oppressed by result-causing karma and kleśas, they have the title of having developed the aspiration to omniscience and have the nobility and greatness of the family of the buddhas, and therefore none of the śrāvakas and pratyeka­buddhas that have reached complete attainment are their equals.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་ཡོངས་སུ་དག་པ་ནི་མིག་ལ་རབ་རིབ་ཀྱི་སྐྱོན་ཡོད་ན་ཡོངས་སུ་མ་དག་པར་སྣང་ངོ་། །
en: “Noble one, a completely pure, precious jewel will appear impure to someone who has the visual defect of cataracts.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པ་ཡང་སེམས་ཅན་དད་པའི་མིག་མི་ཤེས་པའི་རབ་རིབ་ཀྱི་སྐྱོན་དང་ལྡན་པ་རྣམས་ལ་ཡོངས་སུ་མ་དག་པར་སྣང་ངོ་། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, the nature of the jewel of the development of the aspiration to omniscience is pure, but it appears impure to those whose eyes of faith have the defect of the cataracts of ignorance.

source: རྩིའི་གཟུངས་སྔགས་དང་རྩི་ཐམས་ཅད་བསྡུས་ཏེ་བྱས་པ་ནི། རེག་གམ་མཐོང་ངམ། འགྲོགས་ན་ཡང་སེམས་ཅན་གྱི་ནད་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །
en: “Noble one, when all mantras and elixirs have been gathered together and prepared, they heal the illness of beings through being touched or seen, or through being in their presence.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་སྨོན་ལམ་དང་ཡེ་ཤེས་ཀྱི་ལུས་དགེ་བའི་རྩ་བའི་ཚོགས་དང་ཤེས་རབ་དང་ཐབས་ཀྱི་སྔགས་དང་རྩི་ཐམས་ཅད་ལས་བསྒྲུབས་པ་བྱང་ཆུབ་ཀྱི་སེམས་དང་ལྡན་པ་ནི་ཐོས་སམ་མཐོང་ངམ།
en: In the same way, the body of the prayer and wisdom of the aspiration to enlightenment is created from all the mantras and elixirs of the accumulation of roots of merit and of wisdom and method.

source: འགྲོགས་སམ་རྗེས་སུ་དྲན་པའི་ཚུལ་གྱིས་ཀྱང་སེམས་ཅན་གྱི་ཉོན་མོངས་པའི་ནད་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །
en: Hearing, seeing, being in the presence of, or thinking of someone who possesses that aspiration to enlightenment heals the illness of the kleśas of beings.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། གོས་དང་བའི་མཚན་ཉིད་ཅན་ནི་འདམ་གྱི་ཉེས་པ་ཐམས་ཅད་ཀྱིས་མི་གོས་སོ། །
en: “Noble one, clothing that has the characteristic of duck feathers is unstained by the defect of mud.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་གོས་དང་པའི་མཚན་ཉིད་ཅན་ནི་འཁོར་བའི་ཉོན་མོངས་པའི་འདམ་གྱི་སྐྱོན་ཐམས་ཅད་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར་རོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, the aspiration to enlightenment that is the clothing that has the characteristic of duck feathers is not afflicted by the defect of the mud of the kleśas of saṃsāra.

source: ཤིང་གི་གཟུགས་མགོ་གཟེར་གྱིས་བཏབ་པ་ནི་ཡོངས་སུ་འགྱེས་པར་མི་འགྱུར་ཏེ། བྱ་བ་ཐམས་ཅད་ཀྱང་བྱེད་དོ། །
en: “Noble one, a wooden figure that has its head shaft will not fall apart but be able to perform all functions.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྨོན་པའི་ཡེ་ཤེས་ཀྱི་ལུས་ཀྱི་སྤྱི་བོ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་སྨོན་ལམ་གྱི་གཟེར་གྱིས་བཏབ་པ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་བྱ་བ་ཐམས་ཅད་ལ་མཐུ་ཡོད་དེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྨོན་ལམ་གྱི་ཡེ་ཤེས་ལས་ལུས་སུ་གྲུབ་པ་ཡིན་པས་ཡོངས་སུ་འགྱེས་པར་མི་འགྱུར་རོ། །
en: In the same way, if in the head of the body of the wisdom of the prayer for omniscience there is the shaft of the prayer for the development of the aspiration to enlightenment, it will have the power for all bodhisattva activities, and because the body is created from the wisdom of the prayer for omniscience, it will not fall apart.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། གཟེར་དང་མི་ལྡན་པའི་འཁྲུལ་འཁོར་ནི་ཤིང་གི་ཡན་ལག་དེ་ཉིད་ཡིན་ཡང་དགོས་པ་བྱ་བའི་མཐུ་མེད་དོ། །
en: “Noble one, a machine that does not have a shaft, even though it possesses wooden limbs, will not have the power for necessary actions.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་ལྷག་པའི་བསམ་པ་དང་མི་ལྡན་ན། བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཚོགས་དེ་ཉིད་ཡིན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་བསྒྲུབ་པ་ལ་མཐུ་མེད་དོ། །
en: In the same way, if bodhisattvas do not possess the higher motivation of the aspiration to omniscience, even though they have the accumulation of the limbs of enlightenment, they will not have the power to accomplish the Dharma of the buddhas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: “Noble one, a cakravartin has the precious black agarwood called essence of the elephant.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལ་རིན་པོ་ཆེའི་ཨ་ག་རུ་ནག་པོ་གླང་པོའི་སྙིང་པོ་ཞེས་བྱ་བ་ཡོད་པ་དེས་བདུགས་མ་ཐག་ཏུ་རྒྱལ་པོའི་འཁོར་ལོས་སྒྱུར་བའི་ཡན་ལག་བཞིའི་དཔུང་གི་ཚོགས་ཐམས་ཅད་ཀྱང་ནམ་མཁའ་ལ་གནས་པར་འགྱུར་རོ། །
en: As soon as that incense is lit, all four branches of the cakravartin’s army rise up into the sky.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་ཨ་ག་རུས་བདུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱང་ཁམས་གསུམ་པ་ཐམས་ཅད་ལས་རྣམ་པར་འདས་ཏེ། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ནམ་མཁའི་སྤྱོད་ཡུལ་འདུས་མ་བྱས་པ་ཐམས་ཅད་ཀྱི་མཐར་ཐུག་པར་འགྱུར་རོ། །
en: In the same way, all the bodhisattva’s roots of merit, which are the agarwood incense of the development of the aspiration to omniscience, rise above all the three realms and fully accomplish the noncomposite field of activity that is the sky of the wisdom of the tathāgatas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྡོ་རྗེ་ནི་རིན་པོ་ཆེ་མ་རབས་ཀྱི་འབྱུང་ཁུང་ནས་མི་འབྱུང་གི་རྡོ་རྗེའི་འབྱུང་ཁུང་ངམ། གསེར་གྱི་འབྱུང་ཁུངས་ནས་འབྱུང་ངོ་། །
en: “Noble one, diamonds do not come from inferior jewel mines but from diamond mines or from gold mines.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་རྡོ་རྗེ་ལྟ་བུའང་སེམས་ཅན་གྱི་བསམ་པའི་དགེ་བའི་རྩ་བ་མ་རབས་ཀྱི་རིན་པོ་ཆེའི་འབྱུང་གནས་ནས་མི་སྐྱེ་སྟེ།
en: In the same way, the development of the aspiration to omniscience is like a diamond.

source: གཞན་དུ་ན་སེམས་ཅན་ཡོངས་སུ་སྐྱོབ་པའི་སྙིང་རྗེ་ཆེན་པོའི་རྡོ་རྗེའི་འབྱུང་ཁུང་ངམ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ལྷག་པར་དམིགས་པའི་གསེར་གྱི་འབྱུང་ཁུངས་ཆེན་པོ་ནས་འབྱུང་ངོ་། །
en: It does not arise in the jewel mines of the lesser roots of merit of the aspirations of beings, but from the diamond mines of the great compassion that protects beings or from the great gold mines of the higher focus on the omniscient wisdom.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ཤིང་གི་རིགས་རྩ་བ་མེད་པ་ཞེས་བྱ་བ་ཡོད་དེ། དེའི་རྩ་བ་མཐར་ཐུག་པ་མི་དམིགས་མོད་ཀྱི་ཤིང་རྣམས་ལ་ཡལ་ག་དང་ལོ་མ་དང་འདབ་མ་དང་མེ་ཏོག་ཤིན་ཏུ་རྒྱས་པ་དྲ་བ་ལྟ་བུར་གྱུར་པ་ཡང་སྣང་ངོ་། །
en: “Noble one, the class of trees called without a root ultimately has no visible roots, and yet the trees are seen to be covered like a net with branches, leaves, foliage, and flowers.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་དགེ་བའི་རྩ་བའི་མཐར་ཐུག་པའང་མི་དམིགས་མོད་ཀྱི་འཇིག་རྟེན་གྱི་སྐྱེ་གནས་ཐམས་ཅད་དུ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བསོད་ནམས་དང་ཡེ་ཤེས་དང་མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཤིན་ཏུ་རྒྱས་པ་སྨོན་ལམ་ཆེན་པོའི་དྲ་བར་གྱུར་པ་ཡང་ཡོངས་སུ་སྣང་ངོ་། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, there are ultimately no visible roots of merit of the development of the aspiration to omniscience, and yet in all existences in all worlds there appear the extensive flowers of its merit, wisdom, and higher cognitions, as a net of great prayers.

source: རྡོ་རྗེ་ནི་སྣོད་ངན་པའི་གཞི་ལ་འདུག་ན་མཛེས་པར་མི་སྣང་ངོ་། །སྣོད་མ་རྡོལ་བ་མ་གཏོགས་པར་སྣོད་རྡོལ་བ་དང་། བུ་ག་ཅན་གྱིས་གཟུང་བར་མི་ནུས་སོ། །
en: “Noble one, if a diamond is placed in a poor container, it does not appear to be beautiful, and a vessel with cracks or holes cannot contain it, only a vessel in perfect condition.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་རྡོ་རྗེ་ཆེན་པོ་ཡང་སེམས་ཅན་མོས་པ་ཞེན་པའི་སྣོད་དང་། སེར་སྣ་ཅན་ནམ་ཚུལ་ཁྲིམས་ངན་པ་ཅན་ནམ་གནོད་སེམས་ཅན་ནམ། ལེ་ལོ་ཅན་ནམ། དྲན་པ་འཁྲུག་པའམ། ཤེས་རབ་འཆལ་བ་ཅན་རྣམས་ལ་མི་མཛེས་ཏེ། །
en: In the same way, the great diamond of the development of the aspiration to omniscience will not have beauty in the vessels of beings who have weak aspiration, are miserly, have bad conduct, are malevolent, are lazy, have disrupted mindfulness, or have wrong understanding.

source: བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པ་རིན་པོ་ཆེའི་སྣོད་མ་གཏོགས་པར་སེམས་ཅན་ལྷག་པའི་བསམ་པ་ལོག་པ་ལ་ཞུགས་པ་བློ་མི་བརྟན་པའི་སྣོད་ཀྱིས་ཀྱང་གཟུང་བར་མི་ནུས་སོ། །
en: It cannot be contained within beings who are vessels with unstable minds and who follow erroneous higher motivations, but only in the precious vessels of a bodhisattva’s higher motivation.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྡོ་རྗེ་ནི་རིན་པོ་ཆེ་ཐམས་ཅད་འབུགས་སོ། །
en: “Noble one, a diamond can pierce all other jewels.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་རྡོ་རྗེ་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་རིན་པོ་ཆེ་ཐམས་ཅད་ཕུགས་པར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: In the same way, the diamond of the development of the aspiration to omniscience can pierce and comprehend all the precious Dharmas of the buddhas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྡོ་རྗེ་ནི་བྲག་ཐམས་ཅད་ཤིགས་པར་འཇོམ་མོ། །
en: “Noble one, a diamond can cut through and overcome all stones.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་རྡོ་རྗེ་ཡང་། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་ཀྱི་བྲག་ཤིགས་པར་འཇོམ་མོ། །
en: In the same way, the diamond of the development of the aspiration to omniscience can cut through and overcome the stone of false views.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྡོ་རྗེ་རིན་པོ་ཆེ་ནི་ཆག་ཀྱང་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པའི་གསེར་གྱི་རྒྱན་ཟིལ་གྱིས་གནོན་ཏོ། །
en: “Noble one, even if a diamond is broken, it is superior to all other jewels and outshines ornaments of gold.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་རྡོ་རྗེ་རིན་པོ་ཆེ་བསམ་པ་ལོག་པར་ཞུགས་པས་ཆག་པར་གྱུར་ཀྱང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་གྱི་གསེར་གྱི་རྒྱན་ཟིལ་གྱིས་གནོན་ཏོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, even if the diamond jewel of the development of the aspiration to omniscience becomes broken through one’s following erroneous thoughts, it still outshines the golden adornments that are the qualities of all śrāvakas and pratyeka­buddhas.

source: རྡོ་རྗེ་རིན་པོ་ཆེ་ནི་ཆག་ཀྱང་ཕོངས་པ་ཐམས་ཅད་རྣམ་པར་སེལ་ཏོ། །
en: “Noble one, even if a diamond is broken, it will dispel all poverty.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་རྡོ་རྗེ་རིན་པོ་ཆེ་ནན་ཏན་མེད་པས་ཆག་པར་གྱུར་ཀྱང་། འཁོར་བའི་ཕོངས་པ་ཐམས་ཅད་རྣམ་པར་སེལ་ཏོ། །
en: In the same way, even if the diamond jewel of the development of the aspiration to omniscience becomes broken through not being practiced, it can still dispel the poverty that is saṃsāra.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྡོ་རྗེའི་ཁམས་ནི་ཇི་ཙམ་ཞིག་ཏུ་ཆུང་ཡང་ནོར་བུ་དང་རྡོ་ཐམས་ཅད་གཅོག་པའི་མཚན་ཉིད་དོ། །
en: “Noble one, however small a diamond element may be, it still has the characteristic of being able to cut all jewels and stones.

source: དེ་བཞིན་དུ་དམིགས་པ་ཇི་ཙམ་དུ་ཆུང་བ་ལ་ཞུགས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་རྡོ་རྗེའི་ཁམས་ནི་མི་ཤེས་པ་ཐམས་ཅད་འཇིག་པར་བྱེད་པའི་མཚན་ཉིད་དོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, however minor the engagement in the diamond element of the development of the aspiration to omniscience, it still has the characteristic of destroying all ignorance.

source: རྡོ་རྗེ་རིན་པོ་ཆེ་ནི་སྐྱེ་བོ་མ་རབས་ཀྱི་ལག་ཏུ་ཕྱིན་པར་མི་འགྱུར་རོ། །
en: “Noble one, a diamond jewel does not come into the hands of lesser people.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་རྡོ་རྗེ་རིན་པོ་ཆེ་ཡང་མ་རབས་ཀྱི་བསམ་པ་དང་ལྡན་པ། དགེ་བའི་རྩ་བ་ངན་ངོན་ཅན་གྱི་ལྷ་དང་མིའི་ལག་ཏུ་ཕྱིན་པར་མི་འགྱུར་རོ། །
en: In the same way, the diamond jewel of the development of the aspiration to omniscience does not come into the hands of devas and humans who have inferior aspiration and poor roots of merit.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རིན་པོ་ཆེ་ཡོངས་སུ་བརྟག་པ་ལ་མི་མཁས་པའི་སྐྱེས་བུ་ནི་རྡོ་རྗེ་རིན་པོ་ཆེའི་ཡོན་ཏན་མི་ཤེས་པས་དེའི་ཡོན་ཏན་ཉམས་སུ་མྱོང་བར་མི་འགྱུར་རོ། །
en: “Noble one, a person who is not skilled in examining jewels will not know the qualities of a diamond jewel and therefore will not experience its qualities.

source: དེ་བཞིན་དུ་ཤེས་རབ་འཆལ་པའི་ངང་ཚུལ་དང་ལྡན་པའི་སྐྱེས་བུ་གང་ཟག་ཀྱང་བྱང་ཆུབ་ཀྱི་སེམས་རྡོ་རྗེ་རིན་པོ་ཆེ་ཆེན་པོའི་ཡོན་ཏན་ལ་མི་མཁས་པས་ཀྱང་དེའི་ཡོན་ཏན་གྱི་ཁྱད་པར་ཉམས་སུ་མྱོང་བར་མི་འགྱུར་རོ། །
en: In the same way, a person whose understanding is confused is not skilled in the qualities of the great diamond jewel of the development of the aspiration to omniscience and therefore will not experience its qualities.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྡོ་རྗེ་ནི་ཞུ་བར་མི་ནུས་སོ། །
en: “Noble one, a diamond cannot be dissolved.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྒྱུར་གྱུར་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་རྡོ་རྗེ་ཡང་ཞུ་བར་མི་ནུས་སོ། །
en: In the same way, the diamond of the aspiration to enlightenment, which is the cause of omniscience, cannot be dissolved.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྡོ་རྗེའི་ལག་ཅ་ཆེན་པོ་ནི་གཞན་དུ་ན་མཐུ་བོ་ཆེ་ཆེན་པོའི་སྟོབས་ལྟར་ཁྱད་པར་དུ་འཕགས་པའི་མཐུ་སྟོབས་ཀྱི་ཤུགས་དྲག་པོ་མ་གཏོགས་པར་སྟོབས་པོ་ཆེ་ཆེན་པོས་ཀྱང་གཟུང་བར་མི་ནུས་སོ། །
en: “Noble one, the great diamond weapon can only be held by someone who has the superior powerful strength and might of the great Nārāyaṇa, and not by another strongman.
